import { css } from "@emotion/react";

const Story: React.FC = () => {
    return (
        <div style={{display: 'flex', flexDirection: 'column'}}>
            <div css={titleStyle}>
                Story
            </div>
            <div css={contextStyle}>
            기원전 00년 00행성단 00번째 행성에서 문명의 발전을 이룬 ‘도베르만족’.
고도의 과학 기술과 선민의식을 지닌 그들은 다른 행성에도 문명의 전파를 꿈꿨다. 
그들의 손길이 닿은 행성에는 평화를 즐기는 종족도, 욕망이 들끓는 종족도 존재했다. 도베르만은 서로 다른 종족 간의 균형을 맞추고 점차 우주 문명을 구축해나갔다.  
그렇게 문명을 개화시키던 도베르만은 푸른 원석(原石)같은 행성, 지구를 발견한다. 아름다운 자연을 지니고도 아직 원시적인 삶을 살아가는 종족, 인간. 도베르만은 지구에 문명을 싹 틔우고자 했고, 자신들을 대신할 메신저로 ‘자칼족’을 택한다. 
자칼족은 도베르만족보다 지구와 가까운 행성에 살았고, 최근에 문명화된 종족이었다. 그렇기에 자칼족이 원시 종족의 입장에서 문명을 전수하기 더 적합하다 판단했다. 도베르만족은 모든 과학지식을 자칼족에게 전수하며 지구의 문명 자립화를 맡긴다.
도베르만족 지구 책임자 아수스는 자칼족 족장 아누비스와 그의 부하들을 거느리고 지구에 도착했다. 문명의 밭을 일구기 위한 초반 작업이 어느 정도 완성 되자, 아수스는 아누비스에게 진행을 맡기고 본국으로 돌아갔다.
자칼족 수장 아누비스는 문명화 프로젝트의 전권을 위임 받아도 좋을 만큼 뛰어난 능력을 가졌으나, 아수스는 한 가지 간과한 것이 있다. 그것은 아누비스의 넘쳐흐르는 욕망이었다. 
문명화를 맞이한 지구인들은 아누비스를 점점 신격화했고, 아누비스는 자신이 신의 반열에 들어섰다는 착각에 빠져들었다. 최상의 지위를 향한 아누비스의 욕망은 더욱 뜨겁게 불타오른다.
급기야 아누비스는 우주의 지배자가 되기로 결심, 지구의 자원과 도베르만에서 전수받은 과학 지식을 총동원하여 도베르만 행성으로 쳐들어가고 만다. 도베르만 행성을 지원할 다른 행성에도 맹공을 퍼부었다.
자칼의 공격은 매서웠고, 오랜 시간 평화를 누리던 도베르만은 예상치 못한 침략에 무너져갔다. 절체절명의 위기 속에서, 도베르만의 지도자는 캡슐들을 간신히 지구로 보낸다. 자신들을 파괴한 근원지인 지구를 택한 이유는 문명화된 나머지 행성은 아누비스에 의해 도륙되고 식민지화했기 때문이다. 지구는 아누비스가 직접 문명화했으며 인간들은 아누비스를 신으로 받들었기에 자칼족으로부터 무사했다.
캡슐에는 집단 내에서도 뛰어난 초능력을 가진 120마리의 도베르만, V1이라 불리는 이들과 유전자를 통해 배양된 남자 도베르만 배아, 여자 도베르만 배아가 나누어 탑승했다. 그들이 도베르만 종족의 미래, 더 나아가 우주의 미래를 지켜낼 최정예 전사였다.
 
지구로 전송된 캡슐은 도베르만 지도자가 선택한 두 지역에 시차를 두고 도달한다. 캡슐은 각각 방어진을 구축하고 외부에서 보이지 않는 공간을 만들었다. 
외딴 밀림에 떨어진 V2-1호 캡슐의 도베르만은  신체 감각 및 초능력 수련을 통해 신체적인 능력을 최대한 끌어올렸다.
미지의 섬에 착륙한 V2-2호 캡슐의 도베르만은 과학 기술과 유전자 연구를 통해 무기와 유전적인 초능력을 개발했다.
다행히 V2-1, V2-2 도베르만 모두 생존 및 능력 강화라는 최우선 목표를 달성했다. 이제 그들은 다음 단계인 집단의 체계화와 개체수 증식을 이루기 위해 한 곳으로 모이려 한다.
도베르만족은 각 지역에 정찰조를 보내 은신처 물색을 순조롭게 마치고 복귀하던 중, 자칼족과 마주치고 만다. 그렇게 지구에서 최초로 도베르만족 VS 자칼족 전투가 펼쳐진다.  강화된 도베르만족은 자칼족 50 마리 정도는 충분히 제압 가능하지만, 인해전술에 발전한 무기로 밀어부치는 자칼족은 감당하기 어려웠다. 도베르만족은 한계를 느끼며 퇴각하고, 가까스로 만든 포탈을 통해 새로운 지역에 진입, 다시 은신 생활을 시작한다. 
자칼족은 도베르만족을 찾기에 혈안이 되고, 언젠가 다시 있을 전쟁 준비를 위하여 다른 행성을 더욱 가혹하게 수색하고 착취했다. 
더 이상의 시간이 없다고 여긴 도베르만족은 강화된 V2-1과 V2-2의 유전자를 교배하는 과정을 거치고, V3가 탄생한다. 이렇게 태어난 V3는 유전적으로 엄청난 가능성을 지녔으나, 대(對)자칼전을 준비하려면 시간이 부족했다. 폭발적인 성장 속도와 능력 향상을 보장해 줄 특별한 힘. 그 힘의 존재를 도베르만족은 이미 알고 있었다. 그건 바로 ‘우주의 균열선’이다. 
이 균열선은 도베르만 조상들이 문명을 전파하고 다닐 때 발견한 곳이었다. 지혜롭고 선한 도베르만들은 이 힘이 독점될 경우 상당한 위험이 될 것으로 예상하고 균열선에서 나오는 에너지를 봉인했다. 그리고 이 봉인을 풀 수 있는 에너지를 쪼개어 열 두 가문의 수장에게 전달했다. 열 두 가문의 수장은 이 힘으로 인해 초능력을 지녔고, 그 후손에게도 비범한 능력이 전해내려왔다. 이들이 바로 지구로 파견된 V1, 120마리의 도베르만이다. 이 중 열 두 마리의 도베르만은 에너지를 물려받은 직계이자, 균열성의 봉인을 풀 수 있는 존재들이었다.
V1 열 두 수장은 우주의 균열선으로 향하고, 마침내 봉인을 풀어 에테르(에너지의 일종)를 담아 은신처로 가지고 왔다. 이렇게 얻어낸 에테르를 V3 인큐베이터에 주입, V3는 성체로 급격히 성장한다. V3는 이제 유전적인 능력과 함께 본래 가진 힘보다 더 큰 파워를 지니게 된다.
우주의 기운과 지식을 얻게된 V3는 도베르만 종족을 넘어서 신적인 존재로 거듭난다. 그들은 스스로 조직을 재편하고 여러 군단을 만들어냈다. 도베르만족은 군단별로 우주로 흩어져 우주의 평화를 지키기 위해 자칼족과의 전투를 시작한다. 각 군단별로 행성을 정리해나가고 전투는 도베르만족의 승리로 끝이 났다. 이 위대한 도베르만 열두 군단의 이름은 다음과 같다.
제우스, 헤라, 포세이돈, 데메테르, 아테나, 아폴론, 아르테미스, 아레스, 아프로디테, 헤르메스, 헤파이스토스, 디오니소스.
            </div>
        </div>
    )
}

const titleStyle = css`
    width: 100vw;
    font-family: 'Courier New', Courier, monospace;
    font-size: 3.5vw;
    display: flex;
    color: #fff;
    margin: 1%;
`

const contextStyle = css`
    font-family: 'Courier New', Courier, monospace;
    margin: 1%;
    color: #fff;
    display: flex;
    font-size: 1.3vw;
    text-align: left;
    line-height: 130%;
`

export default Story